Tekla Open API Reference for Tekla Structures 2025
PickerInputObject Constructor
 Creates a new PickerInputObject instance representing the pick of a drawing object in a view.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PickerInputObject(
	DrawingObject pickedObject
)
Public Sub New (
	pickedObject As DrawingObject
)
Parameters
pickedObject
Type: Tekla.Structures.Drawing.DrawingObject
The picked drawing object.
See Also
Reference
PickerInputObject Class
Tekla.Structures.Drawing Namespace